cf_billing/InformationRegisters/энргНастройкаСезонностиУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкаСезонностиУслуг</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеПрименятьСезонность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемЗаПрошлыйГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректироватьГодовойОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентНеПрименятьСезонность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкаСезонностиУслуг/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет настройку сезонности услуг.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция НастройкаСезонностиУслуг(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкаСезонностиУслуг());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, НаправлениеИспользованияТУ, МКД, Услуга";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
		Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
			Если ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Пакет.Операторы[0].Отбор.Очистить();
				СоотвествиеПолей 			= ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей;
				ОтборДляУстановки 			= Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей", ПараметрыОтбора.ПараметрыВТ[Сч].ИмяПараметра,"ТипПараметраВременнаяТаблица", СоотвествиеПолей);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргНастройкаСезонностиУслугСрезПоследних",ОтборДляУстановки, "");
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;	 	
		
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецФункции

// Заполняет настройку сезонности услуг коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		 - 	Строка.
//  ТаблицаДляПомещения	 - 	Строка.
//
Процедура НастройкаСезонностиУслугКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкаСезонностиУслугКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, НаправлениеИспользованияТУ, Услуга";
		ИмяТаблицы 					= "НастройкаСезонностиУслуг";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса настройка сезонности услуг.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаНастройкаСезонностиУслуг() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	энргНастройкаСезонностиУслугСрезПоследних.Организация КАК Организация,
	|	энргНастройкаСезонностиУслугСрезПоследних.Район КАК Район,
	|	энргНастройкаСезонностиУслугСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргНастройкаСезонностиУслугСрезПоследних.МКД КАК МКД,
	|	энргНастройкаСезонностиУслугСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкаСезонностиУслугСрезПоследних.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргНастройкаСезонностиУслугСрезПоследних.Коэффициент КАК Коэффициент,
	|	энргНастройкаСезонностиУслугСрезПоследних.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	энргНастройкаСезонностиУслугСрезПоследних.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	энргНастройкаСезонностиУслугСрезПоследних.КоэффициентНеПрименятьСезонность КАК КоэффициентНеПрименятьСезонность
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних КАК энргНастройкаСезонностиУслугСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

// Получает текст запроса настройка сезонности услуг коллекция периодов.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаНастройкаСезонностиУслугКоллекцияПериодов() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	НастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.Коэффициент КАК Коэффициент,
	|	НастройкаСезонностиУслуг.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	НастройкаСезонностиУслуг.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	НастройкаСезонностиУслуг.КоэффициентНеПрименятьСезонность КАК КоэффициентНеПрименятьСезонность
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		НастройкаСезонностиУслуг.Организация КАК Организация,
	|		НастройкаСезонностиУслуг.Район КАК Район,
	|		НастройкаСезонностиУслуг.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		НастройкаСезонностиУслуг.МКД КАК МКД,
	|		НастройкаСезонностиУслуг.Услуга КАК Услуга,
	|		МАКСИМУМ(НастройкаСезонностиУслуг.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргНастройкаСезонностиУслуг КАК НастройкаСезонностиУслуг
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО НастройкаСезонностиУслуг.Организация = ТаблицаПериодов.Организация
	|				И НастройкаСезонностиУслуг.Район = ТаблицаПериодов.Район
	|				И НастройкаСезонностиУслуг.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		НастройкаСезонностиУслуг.Организация,
	|		НастройкаСезонностиУслуг.Район,
	|		НастройкаСезонностиУслуг.НаправлениеИспользованияТУ,
	|		НастройкаСезонностиУслуг.МКД,
	|		НастройкаСезонностиУслуг.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаСезонностиУслуг КАК НастройкаСезонностиУслуг
	|		ПО ВложенныйЗапрос.Организация = НастройкаСезонностиУслуг.Организация
	|			И ВложенныйЗапрос.Район = НастройкаСезонностиУслуг.Район
	|			И ВложенныйЗапрос.НаправлениеИспользованияТУ = НастройкаСезонностиУслуг.НаправлениеИспользованияТУ
	|			И ВложенныйЗапрос.МКД = НастройкаСезонностиУслуг.МКД
	|			И ВложенныйЗапрос.Услуга = НастройкаСезонностиУслуг.Услуга
	|			И ВложенныйЗапрос.Период = НастройкаСезонностиУслуг.Период"; 
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
